гг герой с амнезией просыпается в пещере, у него шиза в виде воспоминаний(но это он узнает позже) и ещё можно здесь сделать что-то типо босса цветка для обучения
в начале, он выходит из пещеры и видет людей, какой-то муждик хорошо с ним обходится, рассказывает какую-то легенды о боссах, потом гг втягивают в какую-то бойню,
мужика убивают, и он идёт мстить за него(или не идёт это зависит от убить или нет какого-то босса (ну короче хз типо концовки разные) или сделать это позже хз), 
ну дальше он идёт по боссам, знакомится с людьми разными и в конце одной из концовок он узнаёт, кто он, а в других либо умирает, либо сдаётся и уходит, 
где встречает чела с шизой
Жанр:фэнтези, рпг; Места событий: город 'Название', несколько лесных локаций; Кратко про Сценарий: Был человек которого звали(игрок задаёт имя персонажу),
и спустили его боги дабы навести порядок на земле, и вообщем он тип в лесу просыпается идёт в город узнаёт больше об данном мире помогает людям 
типо(и на этом впринципе я предлагаю закончить и игроку вывести надпись: 'Продолжение следует'). 
