гг герой с амнезией просыпается в пещере, у него шиза в виде воспоминаний(но это он узнает позже) и ещё можно здесь сделать что-то типо босса цветка для обучения
в начале, он выходит из пещеры и видет людей, какой-то муждик хорошо с ним обходится, рассказывает какую-то легенды о боссах, потом гг втягивают в какую-то бойню,
мужика убивают, и он идёт мстить за него(или не идёт это зависит от убить или нет какого-то босса (ну короче хз типо концовки разные) или сделать это позже хз), 
ну дальше он идёт по боссам, знакомится с людьми разными и в конце одной из концовок он узнаёт, кто он, а в других либо умирает, либо сдаётся и уходит, 
где встречает чела с шизой

Жанр:фэнтези, рпг; Места событий: город 'Название', несколько лесных локаций; Кратко про Сценарий: Был человек которого звали(игрок задаёт имя персонажу),
и спустили его боги дабы навести порядок на земле, и вообщем он тип в лесу просыпается идёт в город узнаёт больше об данном мире помогает людям 
типо(и на этом впринципе я предлагаю закончить и игроку вывести надпись: 'Продолжение следует'). 


гг герой с амнезией просыпается в пещере, у него шиза в виде видения(видением служит картинка на которой изображён мужик а за ним белый фон, а на второй люди и красный фон), он выходит из пещеры и видет людей, разговаривая с ними он понимает что ему тут не рады,
но один из мужиков принимает его домой и вечером они мило разговаривают, на утро люди узнав о том что мужик держит у себя нас убивают его, наш гг хочет отомстить людям и ему даётся выбор
ведущий на две разные концовки(Первый выбор: убить людей, Второй выбор: сбежать). В первом выборе он вырезает всю деревню и уходит далеко в лес. Во втором выборе он без лишних убийств уходит
ночью под тишину леса.
